In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/2b/63/fa344006a41dd696720328af0f1f914f530e9eca2f794607f6af9158897d/pandas-1.5.3-cp38-cp38-macosx_10_9_x86_64.whl (11.9MB)
    100% |████████████████████████████████| 11.9MB 3.2MB/s eta 0:00:01
Collecting pytz>=2020.1 (from pandas)
  Downloading https://files.pythonhosted.org/packages/2e/09/fbd3c46dce130958ee8e0090f910f1fe39e502cc5ba0aadca1e8a2b932e5/pytz-2022.7.1-py2.py3-none-any.whl (499kB)
    100% |████████████████████████████████| 501kB 4.8MB/s ta 0:00:011
Requirement already satisfied: python-dateutil>=2.8.1 in ./venv/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.20.3; python_version < "3.10" in ./venv/lib/python3.8/site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.5.3 pytz-2022.7.1

In [2]:
import pandas as pd

In [3]:
columns = ["Name", "Height", "Age"]
df = pd.DataFrame(columns=columns)
df

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [4]:
df.loc[0] = ["Allen", 175, 22]

In [5]:
df

    Name  Height  Age
0  Allen     175   22

In [6]:
df.loc[1] = ["Ted", 180, 25]

In [7]:
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [8]:
df["Weight"] = [75, 80]

In [9]:
df

    Name  Height  Age  Weight
0  Allen     175   22      75
1    Ted     180   25      80

In [10]:
df.drop(["Weight"], axis=1)

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [11]:
df

    Name  Height  Age  Weight
0  Allen     175   22      75
1    Ted     180   25      80

In [12]:
df = df.drop(["Weight"], axis=1)
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [13]:
df.drop(1)

    Name  Height  Age
0  Allen     175   22

In [14]:
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [15]:
df = df.drop(1)

In [16]:
df

    Name  Height  Age
0  Allen     175   22

In [17]:
df.loc[1] = ["Ted", 180, 25]
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [18]:
df["Age"][1]

25

In [19]:
df["Age"][1] = 30

/var/folders/bv/8bbkzq895db366kq27vw262r0000gn/T/ipykernel_35522/4022022635.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"][1] = 30

In [20]:
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   30

In [22]:
df["Age"] = 28

In [23]:
df

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28

In [25]:
data = [
    ["Jack", 175, 22],
    ["Mary", 180, 25]
]
df2 = pd.DataFrame(data=data, columns=columns)
df2

   Name  Height  Age
0  Jack     175   22
1  Mary     180   25

In [26]:
df

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28

In [27]:
df.append(df2)

/var/folders/bv/8bbkzq895db366kq27vw262r0000gn/T/ipykernel_35522/2094904254.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2)

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
0   Jack     175   22
1   Mary     180   25

In [29]:
df3 = pd.concat([df, df2])
df3

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
0   Jack     175   22
1   Mary     180   25

In [30]:
df3.reset_index()

   index   Name  Height  Age
0      0  Allen     175   28
1      1    Ted     180   28
2      0   Jack     175   22
3      1   Mary     180   25

In [31]:
df3.reset_index(drop=True)

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
2   Jack     175   22
3   Mary     180   25

In [32]:
df3 = df3.reset_index(drop=True)
df3

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
2   Jack     175   22
3   Mary     180   25

In [33]:
df3['Name']

0    Allen
1      Ted
2     Jack
3     Mary
Name: Name, dtype: object